//
//
//      uti
//      type_traits.hpp
//

#pragma once

#ifndef UTI_STD_VER
#       if __cplusplus <= 201103L
#              define UTI_STD_VER 11
#       elif __cplusplus <= 201402L
#               define UTI_STD_VER 14
#       elif __cplusplus <= 201703L
#               define UTI_STD_VER 17
#       elif __cplusplus <= 202002L
#               define UTI_STD_VER 20
#       else
#               define UTI_STD_VER 23
#       endif
#endif

#ifndef UTI_MOVE
#define UTI_MOVE(...) \
        static_cast< typename ::uti::remove_reference_t< decltype(__VA_ARGS__)>&&>(__VA_ARGS__)
#endif

#ifndef UTI_FWD
#define UTI_FWD(...) \
        static_cast< decltype(__VA_ARGS__)&&>(__VA_ARGS__)
#endif


#if !__has_builtin(__is_final)                   || \
    !__has_builtin(__is_empty)                   || \
    !__has_builtin(__is_enum)                    || \
    !__has_builtin(__is_union)                   || \
    !__has_builtin(__underlying_type)            || \
    !__has_builtin(__is_trivially_constructible) || \
    !__has_builtin(__is_trivially_copyable)      || \
    ( !__has_builtin(__is_trivially_destructible)  || !__has_builtin(__has_trivial_destructor) )
#       ifdef UTI_HAS_STL
//              use c++ standard library implementations
#               include <type_traits>
#       else
//              oh boi
#       endif
#else
//      use compiler intrinsics
#endif


namespace uti
{


////////////////////////////////////////////////////////////////////////////////
///     typedefs
////////////////////////////////////////////////////////////////////////////////

using  i8_t =           char ;
using  u8_t = unsigned  char ;
using i16_t =          short ;
using u16_t = unsigned short ;
using i32_t =            int ;
using u32_t = unsigned   int ;
using i64_t =           long ;
using u64_t = unsigned  long ;

static_assert( sizeof(  i8_t ) == 1 ) ;
static_assert( sizeof(  u8_t ) == 1 ) ;
static_assert( sizeof( i16_t ) == 2 ) ;
static_assert( sizeof( u16_t ) == 2 ) ;
static_assert( sizeof( i32_t ) == 4 ) ;
static_assert( sizeof( u32_t ) == 4 ) ;
static_assert( sizeof( i64_t ) == 8 ) ;
static_assert( sizeof( u64_t ) == 8 ) ;

using  size_t = u64_t ;
using ssize_t = i64_t ;

////////////////////////////////////////////////////////////////////////////////
///     consteval
////////////////////////////////////////////////////////////////////////////////

constexpr bool is_constant_evaluated () noexcept
{
#if UTI_STD_VER >= 23
        if consteval
        {
                return true;
        }
        return false;
#elif __has_builtin( __builtin_is_constant_evaluated )
        return __builtin_is_constant_evaluated();
#elif defined( UTI_HAS_STL )
        return std::is_constant_evaluated();
#else
#       error "uti: no implementation for 'is_constant_evaluated' available"
#endif
}

////////////////////////////////////////////////////////////////////////////////
///     identity
////////////////////////////////////////////////////////////////////////////////

template< typename... >
struct void_t
{
        using type = void ;
};

template< auto Val >
struct value_identity
{
